---
type: ExportLinetypeTableIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ExportLinetypeTableIterator

`Autodesk.Revit.DB.ExportLinetypeTableIterator` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsDone | 2014 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2014 | `public virtual bool MoveNext ()` |
| Method | Reset | 2014 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual KeyValuePair < ExportLinetypeKey , ExportLinetypeInfo > Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |